In [7]:
import pandas as pd
from sqlalchemy import create_engine
import numpy as np

In [2]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /Users/user/opt/anaconda3/lib/python3.8/site-packages (1.4.7)
Requirement already satisfied: greenlet!=0.4.17 in /Users/user/opt/anaconda3/lib/python3.8/site-packages (from sqlalchemy) (1.0.0)
Note: you may need to restart the kernel to use updated packages.

In [6]:
# created a dummy daatabase in yor memory
temp_db=create_engine("sqlite:///:memory:")

In [8]:
df=pd.DataFrame(np.random.randint(1,200,(4,4)),columns=["a","b","c","d"])

In [9]:
df

     a    b    c    d
0  111   94   91   30
1   22   72    7  105
2   63  151   41   76
3   53   45  185   41

In [10]:
df.to_sql("xyz",temp_db)

In [11]:
df.to_sql("xyz",temp_db)

ValueError: Table 'xyz' already exists.

In [13]:
df1=pd.read_sql("xyz",temp_db)

In [14]:
df1

   index    a    b    c    d
0      0  111   94   91   30
1      1   22   72    7  105
2      2   63  151   41   76
3      3   53   45  185   41

In [23]:
df.to_sql("xyz23",temp_db,index=False)

In [24]:
df2=pd.read_sql("xyz23",temp_db)
df2

     a    b    c    d
0  111   94   91   30
1   22   72    7  105
2   63  151   41   76
3   53   45  185   41

In [25]:
df3=pd.read_sql_query("select * from xyz23", temp_db)
df3

     a    b    c    d
0  111   94   91   30
1   22   72    7  105
2   63  151   41   76
3   53   45  185   41

In [ ]:
`\